#define F_CPU 16000000   // ระบุว่า MCU ทำงานที่ 16MHz (เพื่อให้โค้ดหน่วงเวลาทำงานถูกต้อง)
#include <avr/io.h>      // โหลดนิยามสำหรับรีจีสเตอร์ที่ควบคุมอินพุท/เอาท์พุท (เช่น PORTD, DDRD)
#include <util/delay.h>  // โหลดนิยามสำหรับฟังก์ชัน _delay_ms()

int main()
{
  DDRD  = 0b00001000;  // กำหนดให้ขา PD3 ทำหน้าที่เอาท์พุท
  PORTD = 0b00000000;  // กำหนดลอจิกขา PD7..0 เป็น 0

  while (1)
  {
    PORTD = 0b00001000;  // ส่งลอจิก 1 ไปที่ขา PD3
    _delay_ms(1000);     // หน่วงเวลารอ 1000 มิลลิวินาที
    PORTD = 0b00000000;  // ส่งลอจิก 0 ไปที่ขา PD3
    _delay_ms(1000);     // หน่วงเวลารอ 1000 มิลลิวินาที
  }
}

